ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_gpio_data_read_regs.xml
<module id="GPIO_DATA_READ_REGS" HW_revision="" description="GPIO DATA READ Registers">
	<register id="GPADAT_R" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="GPIO A Data Read Register">
		<bitfield id="DATA" description="GPADAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPBDAT_R" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="GPIO B Data Read Register">
		<bitfield id="DATA" description="GPBDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPCDAT_R" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="GPIO C Data Read Register">
		<bitfield id="DATA" description="GPCDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPDDAT_R" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="GPIO D Data Read Register">
		<bitfield id="DATA" description="GPDDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPFDAT_R" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="GPIO F Data Read Register">
		<bitfield id="DATA" description="GPFDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPGDAT_R" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="GPIO G Data Read Register">
		<bitfield id="DATA" description="GPGDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPHDAT_R" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="GPIO H Data Read Register">
		<bitfield id="DATA" description="GPHDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
